In [1]:
%load_ext sql

In [2]:
%sql mysql+pymysql://root:WECHALE$0398_wess@localhost:3306/loan_1

Connecting to 'mysql+pymysql://root:***@localhost:3306/loan_1'

In [3]:
%%sql

SELECT * FROM loan_data_clean LIMIT 5;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

5 rows affected.

+-----------------+--------+---------+------------+-----------+---------------+-----------------+-------------------+--------------------+------------------+----------------+---------------+-------------+
| MyUnknownColumn | Gender | Married | Dependents | Education | Self_Employed | ApplicantIncome | CoapplicantIncome |     LoanAmount     | Loan_Amount_Term | Credit_History | Property_Area | Loan_Status |
+-----------------+--------+---------+------------+-----------+---------------+-----------------+-------------------+--------------------+------------------+----------------+---------------+-------------+
|        0        |   1    |    0    |    0.0     |     0     |       0       |       376       |        0.0        | 146.41216216216216 |      360.0       |      1.0       |       2       |      1      |
|        1        |   1    |    1    |    1.0     |     0     |       0       |       306       |       1508.0      |       128.0        |      360.0       |      1.0       |       0       |      0      |
|        2        |   1    |    1    |    0.0     |     0     |       1       |       139       |        0.0        |        66.0        |      360.0       |      1.0       |       2       |      1      |
|        3        |   1    |    1    |    0.0     |     1     |       0       |        90       |       2358.0      |       120.0        |      360.0       |      1.0       |       2       |      1      |
|        4        |   1    |    0    |    0.0     |     0     |       0       |       381       |        0.0        |       141.0        |      360.0       |      1.0       |       2       |      1      |
+-----------------+--------+---------+------------+-----------+---------------+-----------------+-------------------+--------------------+------------------+----------------+---------------+-------------+

In [4]:
%%sql

SELECT COUNT(*) as total_records FROM loan_data_clean;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

1 rows affected.

+---------------+
| total_records |
+---------------+
|      614      |
+---------------+

In [5]:
%%sql

SELECT DISTINCT loan_status FROM loan_data_clean;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

2 rows affected.

+-------------+
| loan_status |
+-------------+
|      1      |
|      0      |
+-------------+

In [6]:
%%sql

SELECT Loan_Status, COUNT(*) as count FROM loan_data_clean GROUP BY Loan_Status;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

2 rows affected.

+-------------+-------+
| Loan_Status | count |
+-------------+-------+
|      1      |  422  |
|      0      |  192  |
+-------------+-------+

In [7]:
%%sql

SELECT Loan_Status,
       MIN(LoanAmount) as Minimum, 
       MAX(LoanAmount) as Maximum,
       AVG(LoanAmount) as Average

FROM loan_data_clean
GROUP BY Loan_Status;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

2 rows affected.

+-------------+---------+---------+--------------------+
| Loan_Status | Minimum | Maximum |      Average       |
+-------------+---------+---------+--------------------+
|      1      |   17.0  |  700.0  | 144.34960612271036 |
|      0      |   9.0   |  570.0  | 150.94548845720723 |
+-------------+---------+---------+--------------------+

In [11]:
%%sql

SELECT AVG(ApplicantIncome) as Average_Income 
FROM loan_data_clean

WHERE Loan_Status = 1;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

1 rows affected.

+----------------+
| Average_Income |
+----------------+
|    246.8152    |
+----------------+

In [12]:
%%sql

SELECT AVG(ApplicantIncome) as Average_Income 
FROM loan_data_clean

WHERE Loan_Status = 0;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

1 rows affected.

+----------------+
| Average_Income |
+----------------+
|    247.7813    |
+----------------+

In [13]:
%%sql

SELECT AVG(ApplicantIncome) as Average_Income 
FROM loan_data_clean

group by Loan_Status;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

2 rows affected.

+----------------+
| Average_Income |
+----------------+
|    246.8152    |
|    247.7813    |
+----------------+

In [16]:
%%sql

SELECT Loan_Status,
AVG(LoanAmount) as Average_Loan_Amount
FROM loan_data_clean

GROUP BY Loan_Status;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

2 rows affected.

+-------------+---------------------+
| Loan_Status | Average_Loan_Amount |
+-------------+---------------------+
|      1      |  144.34960612271036 |
|      0      |  150.94548845720723 |
+-------------+---------------------+

In [17]:
%%sql

SELECT MIN(LoanAmount) as MINIMUM_LOAN_AMOUNT,
MAX(LoanAmount)as MAXIMUM_LOAN_AMOUNT,
AVG(LoanAmount) as AVERAGE_LOAN_AMOUNT

FROM loan_data_clean;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

1 rows affected.

+---------------------+---------------------+---------------------+
| MINIMUM_LOAN_AMOUNT | MAXIMUM_LOAN_AMOUNT | AVERAGE_LOAN_AMOUNT |
+---------------------+---------------------+---------------------+
|         9.0         |        700.0        |  146.41216216216213 |
+---------------------+---------------------+---------------------+

In [19]:
%%sql

SELECT Property_Area, COUNT(*) as Count 

FROM loan_data_clean

GROUP BY Property_Area;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

3 rows affected.

+---------------+-------+
| Property_Area | Count |
+---------------+-------+
|       2       |  202  |
|       0       |  179  |
|       1       |  233  |
+---------------+-------+

In [21]:
%%sql

SELECT Education, COUNT(*) as Count

FROM Loan_data_clean

GROUP BY Education;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

2 rows affected.

+-----------+-------+
| Education | Count |
+-----------+-------+
|     0     |  480  |
|     1     |  134  |
+-----------+-------+

In [24]:
%%sql

SELECT Married, COUNT(*) as Count

FROM loan_data_clean

GROUP BY Married;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

3 rows affected.

+---------+-------+
| Married | Count |
+---------+-------+
|    0    |  213  |
|    1    |  398  |
|    2    |   3   |
+---------+-------+

In [26]:
%%sql

SELECT Property_Area, COUNT(*) as Count

FROM loan_data_clean

GROUP BY Property_Area;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

3 rows affected.

+---------------+-------+
| Property_Area | Count |
+---------------+-------+
|       2       |  202  |
|       0       |  179  |
|       1       |  233  |
+---------------+-------+

In [31]:
%%sql

SELECT ApplicantIncome, LoanAmount, Loan_Status

FROM loan_data_clean

ORDER BY ApplicantIncome DESC

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

614 rows affected.

+-----------------+--------------------+-------------+
| ApplicantIncome |     LoanAmount     | Loan_Status |
+-----------------+--------------------+-------------+
|       504       |       360.0        |      0      |
|       503       |       490.0        |      1      |
|       502       |       700.0        |      1      |
|       501       |       600.0        |      1      |
|       500       |       120.0        |      1      |
|       499       |       152.0        |      1      |
|       498       |       260.0        |      0      |
|       497       |       370.0        |      1      |
|       496       |       480.0        |      1      |
|       495       | 146.41216216216216 |      0      |
+-----------------+--------------------+-------------+
Truncated to displaylimit of 10.

In [33]:
%%sql

SELECT ApplicantIncome, LoanAmount, Loan_Status

FROM loan_data_clean

ORDER BY ApplicantIncome ASC LIMIT 10

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

10 rows affected.

+-----------------+------------+-------------+
| ApplicantIncome | LoanAmount | Loan_Status |
+-----------------+------------+-------------+
|        0        |   135.0    |      0      |
|        1        |    98.0    |      1      |
|        2        |   350.0    |      0      |
|        3        |   113.0    |      1      |
|        4        |   168.0    |      1      |
|        5        |   110.0    |      0      |
|        6        |   216.0    |      1      |
|        6        |   112.0    |      1      |
|        7        |    17.0    |      1      |
|        8        |   167.0    |      0      |
+-----------------+------------+-------------+
Truncated to displaylimit of 10.

In [34]:
%%sql

SELECT ApplicantIncome, LoanAmount, Loan_Status

FROM loan_data_clean

ORDER BY ApplicantIncome DESC LIMIT 10

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

10 rows affected.

+-----------------+--------------------+-------------+
| ApplicantIncome |     LoanAmount     | Loan_Status |
+-----------------+--------------------+-------------+
|       504       |       360.0        |      0      |
|       503       |       490.0        |      1      |
|       502       |       700.0        |      1      |
|       501       |       600.0        |      1      |
|       500       |       120.0        |      1      |
|       499       |       152.0        |      1      |
|       498       |       260.0        |      0      |
|       497       |       370.0        |      1      |
|       496       |       480.0        |      1      |
|       495       | 146.41216216216216 |      0      |
+-----------------+--------------------+-------------+
Truncated to displaylimit of 10.

In [40]:
%%sql

SELECT Gender, 

AVG(ApplicantIncome) as AVERAGE_APPLICANT_INCOME,
AVG(LoanAmount) as AVERAGE_LOAN_AMOUNT
FROM loan_data_clean

GROUP BY Gender;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

3 rows affected.

+--------+--------------------------+---------------------+
| Gender | AVERAGE_APPLICANT_INCOME | AVERAGE_LOAN_AMOUNT |
+--------+--------------------------+---------------------+
|   1    |         251.6748         |  149.15507378544183 |
|   0    |         224.5804         |  127.22532577220076 |
|   2    |         269.8462         |  208.53846153846155 |
+--------+--------------------------+---------------------+

In [42]:
%%sql 

SELECT Married,

AVG(ApplicantIncome) as AVERAGE_APPLICANT_INCOME,
AVG(LoanAmount) as AVERAGE_LOAN_AMOUNT

FROM loan_data_clean

GROUP BY Married;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

3 rows affected.

+---------+--------------------------+---------------------+
| Married | AVERAGE_APPLICANT_INCOME | AVERAGE_LOAN_AMOUNT |
+---------+--------------------------+---------------------+
|    0    |         245.0516         |  129.4595546250476  |
|    1    |         247.5050         |  155.4215333423876  |
|    2    |         342.3333         |  154.80405405405406 |
+---------+--------------------------+---------------------+

In [43]:
%%sql 

SELECT Self_Employed,

AVG(ApplicantIncome) as AVERAGE_APPLICANT_INCOME,
AVG(LoanAmount) as AVERAGE_LOAN_AMOUNT

FROM loan_data_clean

GROUP BY Self_Employed;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

3 rows affected.

+---------------+--------------------------+---------------------+
| Self_Employed | AVERAGE_APPLICANT_INCOME | AVERAGE_LOAN_AMOUNT |
+---------------+--------------------------+---------------------+
|       0       |         236.3680         |  141.9168378378378  |
|       1       |         319.8659         |  171.0638595912986  |
|       2       |         228.6563         |  153.48163006756755 |
+---------------+--------------------------+---------------------+

In [44]:
%%sql

SELECT Credit_History,

AVG(ApplicantIncome) as AVERAGE_APPLICANT_INCOME,
AVG(LoanAmount) as AVERAGE_LOAN_AMOUNT

FROM loan_data_clean

GROUP BY Credit_History;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

2 rows affected.

+----------------+--------------------------+---------------------+
| Credit_History | AVERAGE_APPLICANT_INCOME | AVERAGE_LOAN_AMOUNT |
+----------------+--------------------------+---------------------+
|      1.0       |         249.3600         |  146.36270270270265 |
|      0.0       |         233.8876         |  146.7039174005466  |
+----------------+--------------------------+---------------------+

In [45]:
%%sql

SELECT Property_Area,

AVG(ApplicantIncome) as AVERAGE_APPLICANT_INCOME,
AVG(LoanAmount) as AVERAGE_LOAN_AMOUNT

FROM loan_data_clean

GROUP BY Property_Area;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

3 rows affected.

+---------------+--------------------------+---------------------+
| Property_Area | AVERAGE_APPLICANT_INCOME | AVERAGE_LOAN_AMOUNT |
+---------------+--------------------------+---------------------+
|       2       |         235.4406         |  142.4283850682366  |
|       0       |         259.1564         |  152.06409482107807 |
|       1       |         247.9914         |  145.52386614081894 |
+---------------+--------------------------+---------------------+

In [46]:
%%sql

SELECT Gender,

SUM(CASE WHEN Loan_Status = 1 THEN 1 ELSE 0 END)*100/COUNT(*) as LOAN_APPROVAL_RATE

FROM loan_data_clean

GROUP BY Gender

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

3 rows affected.

+--------+--------------------+
| Gender | LOAN_APPROVAL_RATE |
+--------+--------------------+
|   1    |      69.3252       |
|   0    |      66.9643       |
|   2    |      61.5385       |
+--------+--------------------+

In [47]:
%%sql 

SELECT Married,

SUM(CASE WHEN Loan_Status = 1 THEN 1 ELSE 0 END)*100/COUNT(*) as LOAN_APPROVAL_RATE

FROM loan_data_clean

GROUP BY Married;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

3 rows affected.

+---------+--------------------+
| Married | LOAN_APPROVAL_RATE |
+---------+--------------------+
|    0    |      62.9108       |
|    1    |      71.6080       |
|    2    |      100.0000      |
+---------+--------------------+

In [49]:
%%sql

SELECT Education, 

AVG(ApplicantIncome) as AVERAGE_APPLICANT_INCOME,
AVG(LoanAmount) as AVERAGE_LOAN_AMOUNT

FROM loan_data_clean

GROUP BY Education;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

2 rows affected.

+-----------+--------------------------+---------------------+
| Education | AVERAGE_APPLICANT_INCOME | AVERAGE_LOAN_AMOUNT |
+-----------+--------------------------+---------------------+
|     0     |         261.5813         |  153.82121340090086 |
|     1     |         195.3060         |  119.87227712787414 |
+-----------+--------------------------+---------------------+

In [50]:
%%sql

SELECT Dependents,

AVG(ApplicantIncome) as AVERAGE_APPLICANT_INCOME,
AVG(LoanAmount) as AVERAGE_LOAN_AMONT

FROM loan_data_clean

GROUP BY Dependents;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

4 rows affected.

+------------+--------------------------+--------------------+
| Dependents | AVERAGE_APPLICANT_INCOME | AVERAGE_LOAN_AMONT |
+------------+--------------------------+--------------------+
|    0.0     |         230.6389         | 135.9954391891892  |
|    1.0     |         268.8235         | 158.14361420243773 |
|    2.0     |         258.6436         | 150.11125234145035 |
|    3.0     |         297.1961         | 189.15341812400635 |
+------------+--------------------------+--------------------+

In [51]:
%%sql

SELECT Property_Area,

AVG(ApplicantIncome) as AVERAGE_APPLICANT_INCOME,
AVG(LoanAmount) as AVERAGE_LOAN_AMOUNT

FROM loan_data_clean

GROUP BY Property_Area;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

3 rows affected.

+---------------+--------------------------+---------------------+
| Property_Area | AVERAGE_APPLICANT_INCOME | AVERAGE_LOAN_AMOUNT |
+---------------+--------------------------+---------------------+
|       2       |         235.4406         |  142.4283850682366  |
|       0       |         259.1564         |  152.06409482107807 |
|       1       |         247.9914         |  145.52386614081894 |
+---------------+--------------------------+---------------------+

In [52]:
%%sql

SELECT Self_Employed,

SUM(CASE WHEN Loan_Status = 1 THEN 1 ELSE 0 END)*100/COUNT(*) as LOAN_APPROVAL_RATE

FROM loan_data_clean

GROUP BY Self_Employed;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

3 rows affected.

+---------------+--------------------+
| Self_Employed | LOAN_APPROVAL_RATE |
+---------------+--------------------+
|       0       |      68.6000       |
|       1       |      68.2927       |
|       2       |      71.8750       |
+---------------+--------------------+

In [61]:
%%sql

SELECT ApplicantIncome, LoanAmount, LoanAmount/ApplicantIncome as LOAN_TO_INCOME_RATIO

FROM loan_data_clean

WHERE ApplicantIncome > 0 AND LoanAmount > 0

ORDER BY LOAN_TO_INCOME_RATIO DESC;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

613 rows affected.

+-----------------+------------+----------------------+
| ApplicantIncome | LoanAmount | LOAN_TO_INCOME_RATIO |
+-----------------+------------+----------------------+
|        2        |   350.0    |        175.0         |
|        1        |    98.0    |         98.0         |
|        4        |   168.0    |         42.0         |
|        3        |   113.0    |  37.666666666666664  |
|        6        |   216.0    |         36.0         |
|        5        |   110.0    |         22.0         |
|        8        |   167.0    |        20.875        |
|        12       |   239.0    |  19.916666666666668  |
|        6        |   112.0    |  18.666666666666668  |
|        14       |   201.0    |  14.357142857142858  |
+-----------------+------------+----------------------+
Truncated to displaylimit of 10.

In [63]:
%%sql

SELECT ApplicantIncome, LoanAmount, LoanAmount/ApplicantIncome as LOAN_TO_INCOME_RATIO

FROM loan_data_clean

WHERE ApplicantIncome > 0 AND LoanAmount > 0

ORDER BY LOAN_TO_INCOME_RATIO ASC;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

613 rows affected.

+-----------------+------------+----------------------+
| ApplicantIncome | LoanAmount | LOAN_TO_INCOME_RATIO |
+-----------------+------------+----------------------+
|       354       |    26.0    | 0.07344632768361582  |
|       472       |    40.0    |  0.0847457627118644  |
|       224       |    25.0    | 0.11160714285714286  |
|       480       |    55.0    | 0.11458333333333333  |
|       361       |    44.0    | 0.12188365650969529  |
|       202       |    25.0    | 0.12376237623762376  |
|        68       |    9.0     |  0.1323529411764706  |
|       330       |    48.0    | 0.14545454545454545  |
|       275       |    40.0    | 0.14545454545454545  |
|       476       |    70.0    | 0.14705882352941177  |
+-----------------+------------+----------------------+
Truncated to displaylimit of 10.

In [64]:
%%sql

SELECT Property_Area,

SUM(CASE WHEN Loan_Status = 0 THEN 1 ELSE 0 END)*100/COUNT(*) as LOAN_DEFAULT_RATE

FROM Loan_data_clean

GROUP BY Property_Area;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

3 rows affected.

+---------------+-------------------+
| Property_Area | LOAN_DEFAULT_RATE |
+---------------+-------------------+
|       2       |      34.1584      |
|       0       |      38.5475      |
|       1       |      23.1760      |
+---------------+-------------------+

In [65]:
%%sql

SELECT Education, Self_Employed, 

SUM(CASE WHEN Loan_Status =1 THEN 1 ELSE 0 END)*100/COUNT(*) as APPLICANT_LOAN_APPROVAL_RATE

FROM loan_data_clean

GROUP BY Education, Self_Employed;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

6 rows affected.

+-----------+---------------+------------------------------+
| Education | Self_Employed | APPLICANT_LOAN_APPROVAL_RATE |
+-----------+---------------+------------------------------+
|     0     |       0       |           70.9512            |
|     0     |       1       |           70.7692            |
|     1     |       0       |           60.3604            |
|     0     |       2       |           69.2308            |
|     1     |       1       |           58.8235            |
|     1     |       2       |           83.3333            |
+-----------+---------------+------------------------------+